docs/install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-03 Fri 05:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO Installation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO Installation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9f8070a">1. Install ZIO</a></li>
<li><a href="#orgf60296b">2. Tests</a></li>
<li><a href="#org1efd50c">3. Documentation</a></li>
<li><a href="#orga8fbf5d">4. Python</a>
<ul>
<li><a href="#org9c5f5a3">4.1. Install from source</a></li>
<li><a href="#org7d9a576">4.2. Python Package Index</a></li>
</ul>
</li>
<li><a href="#orga63ef25">5. Installation Details</a>
<ul>
<li><a href="#orgd0f0da3">5.1. spdlog</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorials</a></li>
<li><a href="examples.html">Examples</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<div id="outline-container-org9f8070a" class="outline-2">
<h2 id="org9f8070a"><span class="section-number-2">1</span> Install ZIO</h2>
<div class="outline-text-2" id="text-1">
<p>
ZIO installs in the usual <a href="https://waf.io">Waf</a> way.
</p>

<pre class="example">
$ ./waf configure --prefix=/path/to/install
$ ./waf install
</pre>

<p>
To build, these software dependencies will be located via <a href="https://www.freedesktop.org/wiki/Software/pkg-config/">pkg-config</a>.
</p>

<ul class="org-ul">
<li><a href="https://github.com/zeromq/zyre">Zyre</a> which needs:</li>
<li><a href="https://github.com/zeromq/czmq">CZMQ</a> which needs:</li>
<li><a href="https://github.com/zeromq/libzmq">libzmq</a> (ZIO needs this built with "draft" sockets)</li>
<li><a href="https://github.com/gabime/spdlog#install">spdlog</a></li>
</ul>

<p>
In addition, ZIO uses <a href="https://github.com/zeromq/cppzmq">cppzmq</a> and <a href="https://github.com/nlohmann/json">nlohmann/json</a> and directly includes
copies of these header-only packages.
</p>

<p>
See also <a href="#orga63ef25">5</a> for info on installing the software dependencies.
</p>
</div>
</div>

<div id="outline-container-orgf60296b" class="outline-2">
<h2 id="orgf60296b"><span class="section-number-2">2</span> Tests</h2>
<div class="outline-text-2" id="text-2">
<p>
The default install target will compile and execute units tests.  To
avoid running these tests you may add <code>--notests</code> as:
</p>

<pre class="example">
$ ./waf install --notests
</pre>

<p>
Or, to force their running:
</p>
</div>
</div>

<div id="outline-container-org1efd50c" class="outline-2">
<h2 id="org1efd50c"><span class="section-number-2">3</span> Documentation</h2>
<div class="outline-text-2" id="text-3">
<p>
The generated documentation committed to the repository.  With a
suitable environment (need Emacs and a recent <a href="https://plantuml.com/">plantuml</a>) one can
rebuild it:
</p>

<pre class="example">
$ cd docs
$ make
</pre>
</div>
</div>

<div id="outline-container-orga8fbf5d" class="outline-2">
<h2 id="orga8fbf5d"><span class="section-number-2">4</span> Python</h2>
<div class="outline-text-2" id="text-4">
<p>
ZIO also provides a Python package.  
</p>
</div>

<div id="outline-container-org9c5f5a3" class="outline-3">
<h3 id="org9c5f5a3"><span class="section-number-3">4.1</span> Install from source</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The ZIO Python package installs in "the usual way" from source but its
dependencies need some particular care.  ZIO makes use of PyZMQ, the
Python bindings to <b>libzmq</b> and because ZIO requires ZeroMQ "draft"
sockets, PyZMQ needs to be installed manually in order to enable them
as well as point to an installation of <b>libzmq</b> which includes them.
</p>

<pre class="example">
$ python3 -m venv /path/to/venv
$ source /path/to/venv/bin/activate
$ cd zio/python
$ pip install --pre pyzmq \
    --install-option=--enable-drafts \
    --install-option=--zmq=/path/to/zmq
$ pip install -r requirements.txt
$ pip install [-e] .
</pre>

<p>
In the above, replace <code>/path/to</code> with paths suitable for your
environment.  Use <code>-e</code> option to do in-place development on the <code>zio</code>
Python module.
</p>

<p>
The <code>zio</code> Python module has unit tests which can be run as:
</p>

<pre class="example">
$ cd zio/python/tests
$ python -m unittest 
</pre>
</div>
</div>

<div id="outline-container-org7d9a576" class="outline-3">
<h3 id="org7d9a576"><span class="section-number-3">4.2</span> Python Package Index</h3>
<div class="outline-text-3" id="text-4-2">
<p>
At some point ZIO may be placed in PyPI.  Currently there is an
unsurprising name conflict with "ZIO".  For now, just know that the
<a href="https://pypi.org/project/zio/">four year untouched package currently holding the name ZIO</a> is totally
unrelated to this here project.
</p>
</div>
</div>
</div>

<div id="outline-container-orga63ef25" class="outline-2">
<h2 id="orga63ef25"><span class="section-number-2">5</span> Installation Details</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd0f0da3" class="outline-3">
<h3 id="orgd0f0da3"><span class="section-number-3">5.1</span> spdlog</h3>
<div class="outline-text-3" id="text-5-1">
<p>
For now, ZIO uses spdlog <b>after</b> (and not including) version 1.5.0 which
may mean installing from tip of its git <code>master</code> branch.  ZIO will
likely switch to the next explicit release post-1.5.0 when it is
available.
</p>

<pre class="example">
$ git clone https://github.com/gabime/spdlog.git
$ mkdir spdlog/build &amp;&amp; cd spdlog/build
$ cmake .. \
   -DCMAKE_INSTALL_PREFIX=$HOME/opt/spdlog \
   -DCMAKE_POSITION_INDEPENDENT_CODE=ON
$ make -j
$ make install
</pre>

<p>
For ZIO to find <code>spdlog</code> be sure that you add its <code>pkg-config</code> directory
to the proper variable (along with others).  Eg:
</p>

<pre class="example">
$ export PKG_CONFIG_PATH=$HOME/opt/spdlog/lib/pkgconfig:$HOME/opt/zmq/lib/pkgconfig
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
